if { [ catch {
read_edif {{ synth_output }}/viv_synth.edf
set_property top_file {{ synth_output }}/viv_synth.edf [current_fileset]
link_design -part {{ part }}
{{#xdc}}
read_xdc {{ . }}

{{/xdc}}
{{#clocks}}
create_clock -period {{period}} -name {{ name }}_gen {{#waveform}} -waveform { {{.}} } {{/waveform}} [get_ports {{ name }}]
{{/clocks}}
set_property design_mode GateLvl [current_fileset]
opt_design
place_design
route_design

{{#clock_crank}}
{{#clocks}}
if {[info exists clock_name]} {error "Too many clocks in design for clock crank. Designed for one clock only."}
set period {{period}}
set clock_port {{ name }}
set clock_name {{ name }}_gen
{{/clocks}}
set slack [get_property SLACK [lindex [get_timing_paths] 0]]
set new_period [expr $period - ceil($slack)]
create_clock -period $new_period -name $clock_name [get_ports $clock_port]
while {1} {
    if { [ catch {
        place_design
        route_design
        set slack [get_property SLACK [lindex [get_timing_paths] 0]]
        if {$slack < 0} {break}
        set new_period [expr $new_period - ceil($slack)]
        create_clock -period $new_period -name $clock_name [get_ports $clock_port]
    } ] } {
        break
    }
}
place_design -unplace
route_design -unroute
place_design
phys_opt_design -retime
route_design
# create_clock -period [expr $new_period + 1.0] -name $clock_name [get_ports $clock_port]
# if { [ catch {
#     opt_design
#     place_design
#     route_design
# } ] } {
#     create_clock -period [expr $new_period + 2.0] -name $clock_name [get_ports $clock_port]
#     opt_design
#     place_design
#     route_design
# }

{{/clock_crank}}

write_checkpoint -force -file {{ impl_output }}/impl.dcp
write_edif -force -file {{ impl_output }}/viv_impl.edf
write_verilog -force -file {{ impl_output }}/viv_impl.v
report_utilization -file {{ impl_output }}/utilization.txt
report_timing -file {{ impl_output }}/timing.txt
{{#bit}}
write_bitstream -force {{ . }}

{{/bit}}
} ] } { exit 1 }
exit
